dictionary = [
    "парирование", "армирование", "программа", "моргание", "приговор", "маргарин", "вампир",
    "промоина", "агропром", "игроман", "оригами", "пироман", "апорема", "гонорар", "агроном", "моран",
    "пригрев", "прогрев", "мономер", "ареопаг", "гепарин", "мигание", "наговор", "рамена", "мамона",
    "омоним", "прагма", "понева", "номера", "пример", "регион", "марина", "манера", "маневр", "пони",
    "пионер", "ворона", "перрон", "гормон", "мрамор", "погром", "героин", "нагрев", "оправа", "гаер",
    "пирога", "прогон", "вирион", "репина", "перина", "гарнир", "гример", "гривна", "прорва", "герр",
    "рапира", "верига", "вериги", "мамаев", "павиан", "вагина", "варган", "виагра", "гравер", "вина",
    "минога", "огниво", "игнор", "аниме", "гемор", "амиго", "прана", "нигер", "ванга", "манга", "мое",
    "гемма", "агора", "мамон", "орган", "права", "номер", "роман", "парни", "норма", "прием", "марин",
    "вагон", "порог", "агами", "опера", "опора", "грамм", "погон", "пирог", "овраг", "мирон", "арена",
    "повар", "геном", "гамма", "напор", "манер", "говно", "право", "помин", "ворон", "грива", "гомер",
    "генри", "гнома", "мание", "паром", "говор", "ангар", "прима", "гарем", "имама", "венгр", "мерин",
    "орава", "гомон", "напев", "ампер", "имаго", "помои", "рампа", "ампир", "навар", "омега", "орион",
    "минор", "гонор", "миром", "гиена", "нагар", "манго", "амвон", "норов", "прево", "аргон", "нерпа",
    "минер", "варна", "мирра", "помор", "магма", "варан", "опара", "ворог", "маман", "мара", "мана",
    "ерга", "вира", "пери", "онер", "гема", "инам", "вамп", "прон", "мапа", "аман", "пеон", "нога",
    "ноги", "мама", "мера", "игра", "вера", "мора", "море", "пара", "гора", "враг", "вино", "пиво",
    "мина", "оран", "нерв", "перо", "воин", "рана", "ране", "гнев", "вена", "вено", "ранг", "рама",
    "евро", "нрав", "гром", "пена", "нара", "гимн", "негр", "рева", "нора", "вари", "пира", "нива",
    "инга", "вини", "грим", "морг", "арии", "рами", "пиар", "рома", "гари", "гном", "опер", "гири",
    "грин", "пари", "омар", "амин", "мари", "ринг", "овен", "прим", "пени", "рено", "имам", "репа",
    "мани", "пани", "пион", "вара", "нега", "рамп", "рога", "горн", "омег", "иена", "вага", "мавр",
    "мини", "рани", "мена", "мира", "миро", "арап", "авиа", "вона", "мирр", "опор", "пава", "арго",
    "аира", "мова", "ноев", "рага", "гран", "овин", "агар", "рема", "мне", "она", "они", "вам", "роно",
    "опа", "мир", "ава", "ном", "пин", "вир", "мар", "ног", "оно", "гер", "миг", "гор", "вор", "ген",
    "пар", "рог", "рао", "мга", "нар", "маг", "нор", "пир", "пан", "ион", "ров", "ива", "ера", "иго",
    "мор", "ром", "реп", "гам", "вар", "рио", "риа", "гон", "мим", "пим", "аир", "пом", "ара", "он",
    "га", "го", "ми", "мо", "ор", "ер", "па", "ир", "ом", "аи", "ре", "ро", "ар", "пе", "пи", "ега"]

s1 = "программирование"
total = 0
s3 = []
print('''Игра "Слова из слова" 
*составь слово из загаданного слова и введи его в консоль
*для завершения игры и вывода результатов введи "stop"\n''')
while True:
    while True:
        print(f"Загаданное слово: {s1.upper()}")
        s2 = input().lower()
        if s2 in s3:
            print("Вот ты жужело! Это слово уже было!\n")
        else:
            break
    if s2 == "stop":
        break
    res = ""
    temp = s1
    for i in s2:
        while i in temp:
            res = res + i
            temp = temp.replace(i, "", 1)
            break

    if s2 != res:
        print("Вот ты дурень! Слово не состоит из букв загаданного слова\n")
    elif s2 not in dictionary:
        print("Упс, такого слова нет в словаре\n")
    elif s2 == res:
        print(f"Красава, ты заработал {(t := len(res))} баллов!\n")
        total += t
        s3.append(res)

print(f'''\n===Игра завершена!===
Угаданные слова: {", ".join(s3)}
Итоговый счет: {total} баллов''')



